Table of Contents
 Class FeaUserSelection
Namespace
IdeaStatiCa.BimApiLink.Plugin
Assembly
IdeaStatiCa.BimApiLink.dll
public class FeaUserSelection
Inheritance
object
FeaUserSelection
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Properties
 Combinations
public ICollection<Identifier<IIdeaCombiInput>> Combinations { get; set; }
Property Value
ICollection<Identifier<IIdeaCombiInput>>
 Members
public ICollection<Identifier<IIdeaMember1D>> Members { get; set; }
Property Value
ICollection<Identifier<IIdeaMember1D>>
 Members2D
public ICollection<Identifier<IIdeaMember2D>> Members2D { get; set; }
Property Value
ICollection<Identifier<IIdeaMember2D>>
 Nodes
public ICollection<Identifier<IIdeaNode>> Nodes { get; set; }
Property Value
ICollection<Identifier<IIdeaNode>>
 Edit this page